/* 1. 시간 복잡도 O(n) 
쉽게 알고리즘이 얼마나 오랜 시간동안 계산을 하는지 !

10n^3 + 2n^2 = 
*/
for(i = 0; i < 10; i++){
    for(j = 0; j < n; i++){
        for(d = 0; d < n; i++){
            for(k = 0; k < n; i++){}
            //로직
        }
    }   
}

for(i = 0; i < 2; i++){
    for(j = 0; i < n; i++){
        for(d = 0; i < n; i++){

        }
    }
}

// 입력범위 n을 기준으로 로직이 얼마나 반복되는지

/* 
2. 자료 구조 데이터를 체계적으로 관리하자 ! 
    ex)스택 = 배열 push pop
    큐 = 스택의 반대


3. 정렬

-버블 정렬
둘중 앞이 더크면 둘이 교환
arr[x] vs [x+1]
https://visualgo.net/en/sorting

-선택 정렬
위치와 가장 작은 값을 저장하고 교환.

-삽입 정렬
데이터 하나를 꺼내서 어느 위치에 넣어야할지 비교를 통해 판단.
앞의 숫자가 더 크면 앞으로 이동, 나보다 더 작으면 그자리에 끼워넣기.



*/
